CDiamondGit/stm32_space_invaders/graphics_demo/src/sound_effects.c
#include <stdint.h>
#include <stm32f031x6.h>
#include "musical_notes.h"
#include "display.h"
void pinMode(GPIO_TypeDef *Port, uint32_t BitNumber, uint32_t Mode);
void initSound(void);
void playNote(uint32_t freq);
void stopSound(void);
void twinkle_twinkle(void);

void initSound(void)
{
    // Power up the timer module
	RCC->APB1ENR |= (1 << 8);
	pinMode(GPIOB,1,2); // Assign a non-GPIO (alternate) function to GPIOB bit 1
	GPIOB->AFR[0] &= ~(0x0fu << 4); // Assign alternate function 0 to GPIOB 1 (Timer 14 channel 1)
	TIM14->CR1 = 0; // Set Timer 14 to default values
	TIM14->CCMR1 = (1 << 6) + (1 << 5);
	TIM14->CCER |= (1 << 0);
	TIM14->PSC = 48000000UL/65536UL; // Use the prescaled to set the counter running at 65536 Hz
									 // yields maximum frequency of 21kHz when ARR = 2;
	TIM14->ARR = (48000000UL/(uint32_t)(TIM14->PSC))/((uint32_t)C4);
	TIM14->CCR1 = TIM14->ARR/2;	
	TIM14->CNT = 0;
}

void playNote(uint32_t freq)
{
    // Counter is running at 65536 Hz 
	TIM14->ARR = (uint32_t)65536/((uint32_t)freq); 
	TIM14->CCR1 = TIM14->ARR/2;	
	TIM14->CNT = 0; // set the count to zero initially
	TIM14->CR1 |= (1 << 0); // and enable the counter
}

void stopSound(void)
{
    TIM14->CR1 &= ~TIM_CR1_CEN;  // disable timer
}

void twinkle_twinkle(void)
{
    playNote(C4); delay(250);
    playNote(C4); delay(250);
    playNote(G4); delay(250);
    playNote(G4); delay(250);
    playNote(A4); delay(250);
    playNote(A4); delay(250);
    playNote(G4); delay(500);

    playNote(F4); delay(250);
    playNote(F4); delay(250);
    playNote(E4); delay(250);
    playNote(E4); delay(250);
    playNote(D4); delay(250);
    playNote(D4); delay(250);
    playNote(C4); delay(500);

    playNote(G4); delay(250);
    playNote(G4); delay(250);
    playNote(F4); delay(250);
    playNote(F4); delay(250);
    playNote(E4); delay(250);
    playNote(E4); delay(250);
    playNote(D4); delay(500);

    playNote(G4); delay(250);
    playNote(G4); delay(250);
    playNote(F4); delay(250);
    playNote(F4); delay(250);
    playNote(E4); delay(250);
    playNote(E4); delay(250);
    playNote(D4); delay(500);

    playNote(C4); delay(250);
    playNote(C4); delay(250);
    playNote(G4); delay(250);
    playNote(G4); delay(250);
    playNote(A4); delay(250);
    playNote(A4); delay(250);
    playNote(G4); delay(500);

    playNote(F4); delay(250);
    playNote(F4); delay(250);
    playNote(E4); delay(250);
    playNote(E4); delay(250);
    playNote(D4); delay(250);
    playNote(D4); delay(250);
    playNote(C4); delay(600);

    stopSound();
}